// win 1.2.3 | = mac codexmate_lib::core::models::_::_$LT$impl$u20$serde_core..ser..Serialize$u20$for$u20$codexmate_lib..core..models..ApiConnectivityPayload$GT$::serialize | 跨平台字符串签名匹配(名↔函数一致)
__int64 __fastcall serialize_4(_QWORD *a1, _QWORD *a2, __int64 a3)
{
  __int64 v3; // r14
  int v4; // eax
  __int64 v5; // rax
  unsigned __int8 *v6; // rbx
  unsigned __int8 *v7; // r13
  __int64 v8; // r12
  unsigned __int8 *v9; // rcx
  __int64 v10; // r9
  __int128 v11; // xmm0
  __int128 v12; // xmm0
  __int64 v13; // r8
  char v14; // dl
  bool v15; // zf
  char v16; // cl
  __int64 v17; // rdx
  __int8 v18; // al
  __int8 v19; // al
  __int8 v20; // al
  __int64 v21; // r15
  __int64 v22; // r12
  __int64 v23; // rsi
  __int64 v24; // rdi
  __int64 v25; // rcx
  __int8 v26; // al
  __int128 v27; // xmm0
  __int64 v28; // rax
  char v29; // cl
  __int64 v30; // rdx
  unsigned __int8 *v31; // rsi
  unsigned __int8 *v32; // rbx
  __int64 v33; // rdi
  __int64 v34; // rdx
  __int64 v35; // r8
  __int64 v36; // rcx
  __int64 v37; // rsi
  __int64 v38; // rcx
  __int64 v39; // rax
  char v40; // bl
  __int8 v41; // al
  __int128 v42; // xmm0
  __int64 v43; // rcx
  __int64 v45; // [rsp+30h] [rbp-50h]
  char v46; // [rsp+38h] [rbp-48h] BYREF
  _BYTE v47[31]; // [rsp+39h] [rbp-47h]
  _QWORD *v48; // [rsp+58h] [rbp-28h]
  __m256i v49; // [rsp+60h] [rbp-20h] BYREF
  __int64 v50; // [rsp+80h] [rbp+0h] BYREF
  unsigned __int8 *v51; // [rsp+88h] [rbp+8h]
  __int64 v52; // [rsp+90h] [rbp+10h]
  unsigned __int8 *v53; // [rsp+98h] [rbp+18h]
  __int64 v54; // [rsp+A0h] [rbp+20h]
  int v55; // [rsp+ACh] [rbp+2Ch]
  __m256i v56; // [rsp+B0h] [rbp+30h] BYREF
  __int64 v57; // [rsp+D8h] [rbp+58h]
  __int64 v58; // [rsp+E0h] [rbp+60h]
  const char *v59; // [rsp+E8h] [rbp+68h] BYREF
  __int64 v60; // [rsp+F0h] [rbp+70h]
  __int64 v61; // [rsp+F8h] [rbp+78h]
  __int64 v62; // [rsp+100h] [rbp+80h]
  __int64 v63; // [rsp+108h] [rbp+88h]
  unsigned __int64 v64; // [rsp+110h] [rbp+90h]
  char v65; // [rsp+11Eh] [rbp+9Eh] BYREF
  char v66; // [rsp+11Fh] [rbp+9Fh]
  __int64 v67; // [rsp+120h] [rbp+A0h]
  char v68; // [rsp+12Eh] [rbp+AEh]
  char v69; // [rsp+12Fh] [rbp+AFh]
  __int64 v70; // [rsp+130h] [rbp+B0h]

  v70 = -2; /*0x1408274eb*/
  v3 = (__int64)a1; /*0x1408274f6*/
  v4 = *(unsigned __int8 *)a2; /*0x1408274f9*/
  v48 = a2; /*0x1408274ff*/
  v55 = v4; /*0x140827503*/
  if ( v4 == 20 ) /*0x140827506*/
  {
    v21 = a2[1]; /*0x1408279a7*/
    v23 = a2[3]; /*0x1408279af*/
    v24 = 32 * v23; /*0x1408279b6*/
    v49.m256i_i64[0] = a2[2]; /*0x1408279be*/
    v22 = v49.m256i_i64[0]; /*0x1408279ab*/
    v49.m256i_i64[1] = v49.m256i_i64[0]; /*0x1408279c2*/
    v49.m256i_i64[2] = v21; /*0x1408279c6*/
    v49.m256i_i64[3] = v49.m256i_i64[0] + 32 * v23; /*0x1408279ca*/
    v50 = 0; /*0x1408279ce*/
    v25 = v49.m256i_i64[0]; /*0x1408279d6*/
    v58 = v21; /*0x1408279dc*/
    v62 = v49.m256i_i64[0]; /*0x1408279e0*/
    if ( !v23 /*0x1408279fd*/
      || (v25 = v49.m256i_i64[0] + 32,
          v49.m256i_i64[1] = v49.m256i_i64[0] + 32,
          v26 = *(_BYTE *)v49.m256i_i64[0],
          *(_BYTE *)v49.m256i_i64[0] == 0xFF) )
    {
      v57 = v25; /*0x140827b06*/
      v68 = 1; /*0x140827b0a*/
      v28 = sub_141697AC0(0, &off_141793588, &unk_141792EC8); /*0x140827b21*/
    }
    else
    {
      v57 = v49.m256i_i64[0] + 32; /*0x140827a03*/
      v27 = *(_OWORD *)(v49.m256i_i64[0] + 1); /*0x140827a07*/
      *(_OWORD *)&v56.m256i_u64[2] = *(_OWORD *)(v49.m256i_i64[0] + 16); /*0x140827a13*/
      *(_OWORD *)&v56.m256i_i8[1] = v27; /*0x140827a17*/
      v50 = 1; /*0x140827a1b*/
      v56.m256i_i8[0] = v26; /*0x140827a23*/
      v68 = 1; /*0x140827a26*/
      sub_140804F50(&v59, &v56); /*0x140827a35*/
      if ( (_BYTE)v59 == 1 ) /*0x140827a3f*/
      {
        v28 = v60; /*0x140827a45*/
      }
      else if ( v23 == 1 /*0x140827c28*/
             || (v40 = BYTE1(v59),
                 v57 = v49.m256i_i64[0] + 64,
                 v49.m256i_i64[1] = v49.m256i_i64[0] + 64,
                 v41 = *(_BYTE *)(v49.m256i_i64[0] + 32),
                 v41 == -1) )
      {
        v68 = 1; /*0x140827d03*/
        v28 = sub_141697AC0(1, &off_141793588, &unk_141792EC8); /*0x140827d1d*/
      }
      else
      {
        v42 = *(_OWORD *)(v49.m256i_i64[0] + 33); /*0x140827c2e*/
        *(_OWORD *)&v56.m256i_u64[2] = *(_OWORD *)(v49.m256i_i64[0] + 48); /*0x140827c3a*/
        *(_OWORD *)&v56.m256i_i8[1] = v42; /*0x140827c3e*/
        v50 = 2; /*0x140827c42*/
        v56.m256i_i8[0] = v41; /*0x140827c4a*/
        v68 = 1; /*0x140827c4d*/
        sub_140805C70(&v59, &v56); /*0x140827c5c*/
        v28 = v60; /*0x140827c66*/
        if ( v59 != (const char *)-2LL ) /*0x140827c6e*/
        {
          v43 = v61; /*0x140827c74*/
          v67 = (__int64)v59; /*0x140827c78*/
          *(_QWORD *)v3 = v59; /*0x140827c7f*/
          v64 = v28; /*0x140827c82*/
          *(_QWORD *)(v3 + 8) = v28; /*0x140827c89*/
          *(_QWORD *)(v3 + 16) = v43; /*0x140827c8d*/
          *(_BYTE *)(v3 + 24) = v40; /*0x140827c91*/
          sub_140333130(&v49); /*0x140827c99*/
          if ( v23 == 2 ) /*0x140827ca3*/
            goto LABEL_110; /*0x140827ca3*/
          v56.m256i_i64[0] = 2; /*0x140827cb5*/
          *(_QWORD *)(v3 + 8) = sub_141697AC0(((unsigned __int64)(v24 - 64) >> 5) + 2, &v56, &unk_1417964A8); /*0x140827cd1*/
          *(_QWORD *)v3 = -2; /*0x140827cd5*/
          if ( v67 <= 0 ) /*0x140827ce4*/
            goto LABEL_110; /*0x140827ce4*/
          v35 = 1; /*0x140827cea*/
          v38 = v64; /*0x140827cf0*/
          v34 = v67; /*0x140827cf7*/
          goto LABEL_92; /*0x140827cfe*/
        }
      }
    }
    *(_QWORD *)(v3 + 8) = v28; /*0x140827b27*/
    *(_QWORD *)v3 = -2; /*0x140827b2b*/
    v36 = v57; /*0x140827b32*/
    v64 = (unsigned __int64)(v22 + v24 - v57) >> 5; /*0x140827b3d*/
    v67 = 0; /*0x140827b44*/
    while ( v64 != v67 ) /*0x140827b5e*/
    {
      ++v67; /*0x140827b63*/
      v37 = v36 + 32; /*0x140827b6a*/
      sub_1402C6AA0(); /*0x140827b6e*/
      v36 = v37; /*0x140827b74*/
    }
    if ( !v58 ) /*0x140827b80*/
      goto LABEL_110; /*0x140827b80*/
    v34 = 32 * v58; /*0x140827b86*/
    v35 = 8; /*0x140827b8a*/
LABEL_91:
    v38 = v62; /*0x140827b90*/
LABEL_92:
    sub_140001660(v38, v34, v35); /*0x140827b97*/
    goto LABEL_110; /*0x140827b9c*/
  }
  if ( v4 != 21 ) /*0x14082750f*/
  {
    v69 = 1; /*0x140827e11*/
    a1[1] = sub_14169AB00(a2, &v65, &unk_141794248); /*0x140827e2f*/
    *(_QWORD *)v3 = -2; /*0x140827e33*/
    return v3; /*0x140827e3a*/
  }
  v58 = (__int64)a1; /*0x140827515*/
  v5 = a2[1]; /*0x140827519*/
  v6 = (unsigned __int8 *)a2[2]; /*0x14082751d*/
  v7 = &v6[64 * a2[3]]; /*0x140827529*/
  v50 = (__int64)v6; /*0x140827530*/
  v51 = v6; /*0x140827534*/
  v52 = v5; /*0x140827538*/
  v53 = v7; /*0x14082753c*/
  v49.m256i_i8[0] = -1; /*0x140827540*/
  v54 = 0; /*0x140827544*/
  LOBYTE(v64) = -1; /*0x140827554*/
  v67 = -2; /*0x14082755b*/
  v8 = 0; /*0x14082756d*/
  while ( 1 ) /*0x140827570*/
  {
    v9 = v6; /*0x140827570*/
    if ( v6 == v7 ) /*0x140827576*/
      break; /*0x140827576*/
    v6 += 64; /*0x14082757c*/
    v51 = v9 + 64; /*0x140827580*/
    v10 = *v9; /*0x140827584*/
    if ( (_DWORD)v10 == 255 ) /*0x14082758f*/
      break; /*0x14082758f*/
    v54 = ++v8; /*0x140827598*/
    v46 = v10; /*0x14082759c*/
    v11 = *(_OWORD *)(v9 + 1); /*0x1408275a0*/
    *(_OWORD *)&v47[15] = *((_OWORD *)v9 + 1); /*0x1408275a8*/
    *(_OWORD *)v47 = v11; /*0x1408275ac*/
    v12 = *((_OWORD *)v9 + 2); /*0x1408275af*/
    *(_OWORD *)&v49.m256i_u64[2] = *((_OWORD *)v9 + 3); /*0x1408275b7*/
    *(_OWORD *)v49.m256i_i8 = v12; /*0x1408275bb*/
    v13 = (unsigned int)(v10 - 1); /*0x1408275bf*/
    switch ( (int)v10 ) /*0x1408275dc*/
    {
      case 1: /*0x1408275dc*/
        v14 = 2 - (v47[0] == 1); /*0x1408275ea*/
        v15 = v47[0] == 0; /*0x1408275ec*/
        goto LABEL_29; /*0x1408275ee*/
      case 4: /*0x1408275dc*/
        v14 = 2 - (*(_QWORD *)&v47[7] == 1); /*0x1408276ff*/
        v15 = *(_QWORD *)&v47[7] == 0; /*0x140827701*/
LABEL_29:
        v16 = v14; /*0x140827704*/
        if ( v15 ) /*0x14082770c*/
          v16 = 0; /*0x14082770c*/
        goto LABEL_54; /*0x14082770c*/
      case 12: /*0x1408275dc*/
        if ( *(_QWORD *)&v47[23] != 14 ) /*0x140827720*/
        {
          if ( *(_QWORD *)&v47[23] != 11 /*0x140827751*/
            || (v13 = 0x7375746174536567LL,
                **(_QWORD **)&v47[15] ^ 0x6174536567617375LL
              | *(_QWORD *)(*(_QWORD *)&v47[15] + 3LL) ^ 0x7375746174536567LL) )
          {
LABEL_64:
            v17 = *(_QWORD *)&v47[7]; /*0x1408278f3*/
            BYTE1(v59) = 2; /*0x1408278f9*/
            if ( !*(_QWORD *)&v47[7] ) /*0x1408278ff*/
              goto LABEL_55; /*0x1408278ff*/
          }
          else
          {
            v17 = *(_QWORD *)&v47[7]; /*0x14082775c*/
            BYTE1(v59) = 0; /*0x140827760*/
            if ( !*(_QWORD *)&v47[7] ) /*0x140827766*/
              goto LABEL_55; /*0x140827766*/
          }
LABEL_65:
          sub_140001660(*(_QWORD *)&v47[15], v17, 1); /*0x140827905*/
          goto LABEL_55; /*0x140827910*/
        }
        v13 = 0x726F727245747361LL; /*0x1408278dd*/
        if ( **(_QWORD **)&v47[15] ^ 0x73614C6567617375LL /*0x1408278ea*/
           | *(_QWORD *)(*(_QWORD *)&v47[15] + 6LL) ^ 0x726F727245747361LL )
        {
          goto LABEL_64; /*0x1408278ed*/
        }
        v17 = *(_QWORD *)&v47[7]; /*0x140827992*/
        BYTE1(v59) = 1; /*0x140827996*/
        if ( *(_QWORD *)&v47[7] ) /*0x14082799c*/
          goto LABEL_65; /*0x14082799c*/
LABEL_55:
        if ( BYTE1(v59) == 2 ) /*0x140827818*/
        {
          v18 = v49.m256i_i8[0]; /*0x14082781a*/
          v49.m256i_i8[0] = -1; /*0x14082781e*/
          if ( v18 == -1 ) /*0x140827824*/
          {
            v63 = v67; /*0x140827d4a*/
            sub_1416C3000(aMapaccessNextV, 44, &off_141794808); /*0x140827d64*/
          }
          *(_OWORD *)&v56.m256i_u64[2] = *(_OWORD *)&v49.m256i_u64[2]; /*0x140827832*/
          *(_OWORD *)&v56.m256i_i8[1] = *(_OWORD *)&v49.m256i_i8[1]; /*0x140827837*/
          v56.m256i_i8[0] = v18; /*0x14082783b*/
          v63 = v67; /*0x140827845*/
          sub_1407DAAC0(&v56); /*0x140827850*/
        }
        else if ( BYTE1(v59) ) /*0x14082785d*/
        {
          if ( v67 != -2 ) /*0x140827920*/
          {
            v59 = aUsagelasterror; /*0x140827e7d*/
            v60 = 14; /*0x140827e81*/
            v56.m256i_i64[0] = (__int64)&v59; /*0x140827e8d*/
            v56.m256i_i64[1] = (__int64)sub_14041F680; /*0x140827e98*/
            v63 = v67; /*0x140827e9c*/
            v39 = sub_141697610(&unk_14177DAF4, &v56, v13); /*0x140827eae*/
            goto LABEL_106; /*0x140827eb4*/
          }
          v20 = v49.m256i_i8[0]; /*0x140827926*/
          v49.m256i_i8[0] = -1; /*0x14082792a*/
          if ( v20 == -1 ) /*0x140827930*/
          {
            v63 = -2; /*0x140827f2c*/
            sub_1416C3000(aMapaccessNextV, 44, &off_141794808); /*0x140827f4a*/
          }
          *(_OWORD *)&v56.m256i_u64[2] = *(_OWORD *)&v49.m256i_u64[2]; /*0x14082793e*/
          *(_OWORD *)&v56.m256i_i8[1] = *(_OWORD *)&v49.m256i_i8[1]; /*0x140827943*/
          v56.m256i_i8[0] = v20; /*0x140827947*/
          v63 = -2; /*0x14082794a*/
          sub_140805C70(&v59, &v56); /*0x14082795d*/
          v62 = v60; /*0x14082796b*/
          if ( v59 == (const char *)-2LL ) /*0x140827976*/
          {
            v3 = v58; /*0x140827d28*/
            *(_QWORD *)(v58 + 8) = v62; /*0x140827d33*/
            *(_QWORD *)v3 = -2; /*0x140827d37*/
            goto LABEL_108; /*0x140827d3e*/
          }
          v67 = (__int64)v59; /*0x14082797c*/
          v45 = v61; /*0x140827987*/
        }
        else
        {
          if ( (_BYTE)v64 != 0xFF ) /*0x14082786a*/
          {
            v59 = aUsagestatus; /*0x140827ec0*/
            v60 = 11; /*0x140827ec4*/
            v56.m256i_i64[0] = (__int64)&v59; /*0x140827ed0*/
            v56.m256i_i64[1] = (__int64)sub_14041F680; /*0x140827edb*/
            v63 = v67; /*0x140827ee6*/
            v39 = sub_141697610(&unk_14177DAF4, &v56, v13); /*0x140827ef8*/
LABEL_106:
            v3 = v58; /*0x140827d9a*/
            *(_QWORD *)(v58 + 8) = v39; /*0x140827d9e*/
            *(_QWORD *)v3 = -2; /*0x140827da2*/
            if ( v67 > 0 ) /*0x140827db3*/
              sub_140001660(v62, v67, 1); /*0x140827dc2*/
LABEL_108:
            sub_140333800(&v50); /*0x140827dc8*/
            if ( v49.m256i_i8[0] != -1 ) /*0x140827dd5*/
            {
              v69 = 0; /*0x140827dd7*/
              sub_1407DAAC0(&v49); /*0x140827de2*/
            }
            goto LABEL_110; /*0x140827de2*/
          }
          v19 = v49.m256i_i8[0]; /*0x140827870*/
          v49.m256i_i8[0] = -1; /*0x140827874*/
          if ( v19 == -1 ) /*0x14082787a*/
          {
            v63 = v67; /*0x140827f0a*/
            sub_1416C3000(aMapaccessNextV, 44, &off_141794808); /*0x140827f24*/
          }
          *(_OWORD *)&v56.m256i_u64[2] = *(_OWORD *)&v49.m256i_u64[2]; /*0x140827888*/
          *(_OWORD *)&v56.m256i_i8[1] = *(_OWORD *)&v49.m256i_i8[1]; /*0x14082788d*/
          v56.m256i_i8[0] = v19; /*0x140827891*/
          v63 = v67; /*0x14082789b*/
          sub_140804F50(&v59, &v56); /*0x1408278aa*/
          if ( (_BYTE)v59 == 1 ) /*0x1408278b4*/
          {
LABEL_105:
            v39 = v60; /*0x140827d96*/
            goto LABEL_106; /*0x140827d96*/
          }
          LOBYTE(v64) = BYTE1(v59); /*0x1408278be*/
        }
        break; /*0x140827856*/
      case 13: /*0x1408275dc*/
        if ( *(_QWORD *)&v47[15] == 14 ) /*0x1408275f7*/
        {
          if ( **(_QWORD **)&v47[7] ^ 0x73614C6567617375LL /*0x140827792*/
             | *(_QWORD *)(*(_QWORD *)&v47[7] + 6LL) ^ 0x726F727245747361LL )
          {
            goto LABEL_53; /*0x140827795*/
          }
          v16 = 1; /*0x140827797*/
          goto LABEL_54; /*0x140827799*/
        }
        if ( *(_QWORD *)&v47[15] != 11 /*0x140827628*/
          || **(_QWORD **)&v47[7] ^ 0x6174536567617375LL | *(_QWORD *)(*(_QWORD *)&v47[7] + 3LL) ^ 0x7375746174536567LL )
        {
          goto LABEL_53; /*0x14082762b*/
        }
        goto LABEL_11; /*0x14082762b*/
      case 14: /*0x1408275dc*/
        v57 = v10; /*0x1408276be*/
        v56.m256i_i64[2] = *((_QWORD *)v9 + 3); /*0x1408276c6*/
        *(_OWORD *)v56.m256i_i8 = *(_OWORD *)(v9 + 8); /*0x1408276ce*/
        v66 = 1; /*0x1408276d2*/
        sub_140ABDE70(&v59, &v56, v13); /*0x1408276e1*/
        if ( (_BYTE)v59 ) /*0x1408276eb*/
          goto LABEL_105; /*0x1408276eb*/
        goto LABEL_55; /*0x1408276eb*/
      case 15: /*0x1408275dc*/
        if ( *(_QWORD *)&v47[15] != 14 ) /*0x14082763c*/
        {
          if ( *(_QWORD *)&v47[15] == 11 /*0x1408276b3*/
            && **(_BYTE **)&v47[7] == 117
            && *(_BYTE *)(*(_QWORD *)&v47[7] + 1LL) == 115
            && *(_BYTE *)(*(_QWORD *)&v47[7] + 2LL) == 97
            && *(_BYTE *)(*(_QWORD *)&v47[7] + 3LL) == 103
            && *(_BYTE *)(*(_QWORD *)&v47[7] + 4LL) == 101
            && *(_BYTE *)(*(_QWORD *)&v47[7] + 5LL) == 83
            && *(_BYTE *)(*(_QWORD *)&v47[7] + 6LL) == 116
            && *(_BYTE *)(*(_QWORD *)&v47[7] + 7LL) == 97
            && *(_BYTE *)(*(_QWORD *)&v47[7] + 8LL) == 116
            && *(_BYTE *)(*(_QWORD *)&v47[7] + 9LL) == 117
            && *(_BYTE *)(*(_QWORD *)&v47[7] + 10LL) == 115 )
          {
LABEL_11:
            v16 = 0; /*0x140827631*/
            goto LABEL_54; /*0x140827633*/
          }
LABEL_53:
          v16 = 2; /*0x1408277f0*/
          goto LABEL_54; /*0x1408277f0*/
        }
        if ( **(_BYTE **)&v47[7] != 117 ) /*0x14082779e*/
          goto LABEL_53; /*0x14082779e*/
        if ( *(_BYTE *)(*(_QWORD *)&v47[7] + 1LL) != 115 ) /*0x1408277a4*/
          goto LABEL_53; /*0x1408277a4*/
        if ( *(_BYTE *)(*(_QWORD *)&v47[7] + 2LL) != 97 ) /*0x1408277aa*/
          goto LABEL_53; /*0x1408277aa*/
        if ( *(_BYTE *)(*(_QWORD *)&v47[7] + 3LL) != 103 ) /*0x1408277b0*/
          goto LABEL_53; /*0x1408277b0*/
        if ( *(_BYTE *)(*(_QWORD *)&v47[7] + 4LL) != 101 ) /*0x1408277b6*/
          goto LABEL_53; /*0x1408277b6*/
        if ( *(_BYTE *)(*(_QWORD *)&v47[7] + 5LL) != 76 ) /*0x1408277bc*/
          goto LABEL_53; /*0x1408277bc*/
        if ( *(_BYTE *)(*(_QWORD *)&v47[7] + 6LL) != 97 ) /*0x1408277c2*/
          goto LABEL_53; /*0x1408277c2*/
        if ( *(_BYTE *)(*(_QWORD *)&v47[7] + 7LL) != 115 ) /*0x1408277c8*/
          goto LABEL_53; /*0x1408277c8*/
        if ( *(_BYTE *)(*(_QWORD *)&v47[7] + 8LL) != 116 ) /*0x1408277ce*/
          goto LABEL_53; /*0x1408277ce*/
        if ( *(_BYTE *)(*(_QWORD *)&v47[7] + 9LL) != 69 ) /*0x1408277d4*/
          goto LABEL_53; /*0x1408277d4*/
        if ( *(_BYTE *)(*(_QWORD *)&v47[7] + 10LL) != 114 ) /*0x1408277da*/
          goto LABEL_53; /*0x1408277da*/
        if ( *(_BYTE *)(*(_QWORD *)&v47[7] + 11LL) != 114 ) /*0x1408277e0*/
          goto LABEL_53; /*0x1408277e0*/
        if ( *(_BYTE *)(*(_QWORD *)&v47[7] + 12LL) != 111 ) /*0x1408277e6*/
          goto LABEL_53; /*0x1408277e6*/
        v16 = 1; /*0x1408277e8*/
        if ( *(_BYTE *)(*(_QWORD *)&v47[7] + 13LL) != 114 ) /*0x1408277ee*/
          goto LABEL_53; /*0x1408277ee*/
LABEL_54:
        BYTE1(v59) = v16; /*0x1408277f2*/
        LOBYTE(v59) = 0; /*0x1408277f5*/
        v63 = v67; /*0x140827800*/
        sub_1407DAAC0(&v46); /*0x14082780b*/
        goto LABEL_55; /*0x14082780b*/
      default:
        v57 = v10; /*0x140827d6f*/
        v66 = 0; /*0x140827d73*/
        v60 = sub_14169AB00(&v46, &v65, &unk_1417946C8); /*0x140827d92*/
        goto LABEL_105; /*0x140827d92*/
    }
  }
  v29 = v64; /*0x140827a4e*/
  if ( (_BYTE)v64 == 0xFF ) /*0x140827a58*/
  {
    v59 = aUsagestatus; /*0x140827ba8*/
    v60 = 11; /*0x140827bac*/
    v56.m256i_i64[0] = (__int64)&v59; /*0x140827bb8*/
    v56.m256i_i64[1] = (__int64)sub_14041F680; /*0x140827bc3*/
    v63 = v67; /*0x140827bce*/
    v39 = sub_141697610(&unk_14177DA78, &v56, a3); /*0x140827be0*/
    goto LABEL_106; /*0x140827be6*/
  }
  v30 = -1; /*0x140827a69*/
  if ( v67 != -2 ) /*0x140827a70*/
    v30 = v67; /*0x140827a70*/
  v3 = v58; /*0x140827a74*/
  v67 = v30; /*0x140827a78*/
  *(_QWORD *)v58 = v30; /*0x140827a7f*/
  *(_QWORD *)(v3 + 8) = v62; /*0x140827a89*/
  *(_QWORD *)(v3 + 16) = v45; /*0x140827a91*/
  *(_BYTE *)(v3 + 24) = v29; /*0x140827a95*/
  LOBYTE(v64) = v49.m256i_i8[0]; /*0x140827a9d*/
  v31 = v51; /*0x140827aa3*/
  v32 = v53; /*0x140827aa7*/
  sub_140333800(&v50); /*0x140827aae*/
  if ( v32 != v31 ) /*0x140827ab7*/
  {
    v56.m256i_i64[0] = v8; /*0x140827e46*/
    v33 = sub_141697AC0(v8 + ((unsigned __int64)(v32 - v31) >> 6), &v56, &unk_1417964C8); /*0x140827e5e*/
    if ( (_BYTE)v64 == 0xFF ) /*0x140827e68*/
      goto LABEL_82; /*0x140827e68*/
    goto LABEL_81; /*0x140827e68*/
  }
  v33 = 0; /*0x140827abd*/
  if ( (_BYTE)v64 != 0xFF ) /*0x140827ac6*/
LABEL_81:
    sub_1407DAAC0(&v49); /*0x140827ac8*/
LABEL_82:
  if ( !v33 ) /*0x140827ad5*/
  {
    *(_QWORD *)v3 = v67; /*0x140827bf2*/
    *(_QWORD *)(v3 + 8) = v62; /*0x140827bfc*/
    goto LABEL_110; /*0x140827c00*/
  }
  *(_QWORD *)(v3 + 8) = v33; /*0x140827adb*/
  *(_QWORD *)v3 = -2; /*0x140827adf*/
  v34 = v67; /*0x140827ae6*/
  if ( (unsigned __int64)(v67 - 1) <= 0xFFFFFFFFFFFFFFFDuLL ) /*0x140827af5*/
  {
    v35 = 1; /*0x140827afb*/
    goto LABEL_91; /*0x140827b01*/
  }
LABEL_110:
  if ( (v55 & 0x1E) != 0x14 ) /*0x140827df3*/
    sub_1407DAAC0(v48); /*0x140827df5*/
  return v3; /*0x140827dfd*/
}